{ 
	"title": "Grilled Cheese", 
	"price": 1.99,
	"stars": 5,
	"difficulty": "easy",
	"country": "United States",
	"ingredients": {
		"bread": "2 slices",
		"cheese": "2 slices",
		"butter": "1 tbsp"
	},
	"culture": "Grilled cheese is a popular American dish that consists of a sandwich made with melted cheese between two slices of buttered bread, which is then grilled until the cheese is melted and the bread is crispy. The origins of the grilled cheese sandwich are not clear, but it is believed to have been around since the early 20th century. In the 1920s, sliced bread and processed cheese became widely available, and this made it easier for people to make grilled cheese sandwiches at home. The grilled cheese sandwich has become a cultural icon in the United States, and it is often associated with childhood memories and comfort food. It is a popular lunchtime option for school children, and any adults also enjoy it as a quick and easy meal. There are many variations of the grilled cheese sandwich, and it can be made with different types of bread and cheese. Some people like to add additional ingredients, such as ham, bacon, or tomato, to create a more substantial sandwich. In recent years, the grilled cheese sandwich has experienced a resurgence in popularity, and many restaurants now offer gourmet versions of the classic dish. There are even grilled cheese competitions and festivals held throughout the country, celebrating the beloved sandwich.",
	"recipe": "Heat a non-stick skillet or griddle over medium heat. Butter one side of each slice of bread. Place one slice of bread, butter-side down, in the skillet. Place one slice of cheese on top of the bread. Place the other slice of bread, butter-side up, on top of the cheese. Cook until the bottom slice of bread is golden brown and the cheese has started to melt, about 2-3 minutes. Flip the sandwich over and cook until the other side is golden brown and the cheese is completely melted, about 2-3 minutes more. Remove from heat and let cool for a minute or two. Cut the sandwich in half (optional) and serve hot.",
	"photo": "grilled-cheese.jpg"
}