{ 
	"title": "Instant Noodles", 
	"price": 0.99,
	"stars": 3,
	"difficulty": "easy",
	"country": "Japan",
	"ingredients": {
		"instant noodles": "1 packet"
	},
	"culture": "Instant noodles, also known as cup noodles or ramen, were first invented by the Japanese food company Nissin in 1958. The inventor, Momofuku Ando, was inspired by the popularity of traditional Japanese ramen, but wanted to create a more convenient and portable version that could be easily prepared and eaten on-the-go. Ando's first instant noodle product, \"Chikin Ramen,\" was a huge success in Japan and soon became popular in other parts of the world. In the 1970s, Nissin introduced Cup Noodles, which are pre-cooked and packaged in a foam cup with a seasoning packet. These cups became a popular convenience food and are still widely consumed today. Instant noodles have become an important part of many cultures around the world, particularly in Asia. In South Korea, instant noodles are often served with spicy kimchi or vegetables, while in Indonesia, they are often cooked with egg and vegetables and served with peanut sauce. In Japan, instant noodles are often eaten as a quick snack or meal and are available in a wide variety of flavors and styles. Instant noodles have also become a staple food for many college students and people on a tight budget due to their affordability and convenience. They are also a popular food item for hikers and campers, as they are lightweight and easy to prepare.",
	"recipe": "Begin by boiling water in a pot. The amount of water you need will depend on the size of the pot and the amount of noodles you're preparing, but generally you want enough water to cover the noodles. Once the water comes to a boil, add the ramen noodles and cook for 2-3 minutes or until the noodles are soft. Use a fork or chopsticks to loosen the noodles and prevent them from sticking together. While the noodles are cooking, open the flavor packet and add it to a separate bowl. Once the noodles are cooked, use a strainer or colander to drain the water from the pot, leaving the noodles behind. Transfer the noodles to the bowl with the flavor packet and mix well, making sure the noodles are evenly coated with the seasoning. If desired, you can also add other ingredients to the noodles such as sliced boiled eggs, chopped green onions, or cooked vegetables. Serve and enjoy your delicious instant ramen!",
	"photo": "instant-noodles.jpg"
}