{ 
	"title": "Moussaka", 
	"price": 20.00,
	"stars": 5,
	"difficulty": "hard",
	"country": "Greece",
	"ingredients": {
        "ground beef": "1 lb",
        "eggplant": "2 medium",
        "potatoes": "2 large",
        "onion": "1 medium",
        "garlic": "2 cloves",
        "tomato paste": "2 tbsp",
        "cinnamon": "1 tsp",
        "allspice": "1/4 tsp",
        "oregano": "1 tsp",
        "salt": "1 tsp",
        "pepper": "1/4 tsp",
        "olive oil": "1/4 cup",
        "flour": "3 tbsp",
        "milk": "2 cups",
        "nutmeg": "1/4 tsp",
        "feta cheese": "4 oz",
        "breadcrumbs": "1/4 cup"
    },
	"culture": "Moussaka is a traditional dish of the Eastern Mediterranean region, especially Greece, Turkey, and the Balkans. Its exact origin is not clear, but it is believed to have originated in the Ottoman Empire and then spread to neighboring countries. It is typically made with eggplant, potatoes, ground meat (usually lamb or beef), and a béchamel sauce. Moussaka is a popular dish in Greek cuisine and is often served as a main course. It is also commonly found in Middle Eastern and Mediterranean cuisine, with variations that include zucchini or other vegetables in place of eggplant. The dish has become popular worldwide and is often served in Greek and Mediterranean restaurants.",
	"recipe": "To make moussaka, first preheat the oven to 375°F. Next, peel and slice the eggplant and layer the slices in a colander, sprinkling each layer with salt. Let the eggplant sit for 30 minutes to remove any bitterness. Rinse the eggplant and pat dry with a paper towel. Heat a skillet over medium heat and add oil. Brown the ground beef and onions in the skillet and then add the garlic, cinnamon, and allspice. Cook for a few more minutes and then stir in the tomato sauce and red wine. Let the mixture simmer for 10-15 minutes. In a separate saucepan, make the béchamel sauce by melting butter and then adding flour and milk. Cook until the sauce thickens and then stir in egg yolks and parmesan cheese. In a greased baking dish, layer the eggplant and meat mixture, starting and ending with the eggplant. Pour the béchamel sauce over the top and sprinkle with additional parmesan cheese. Bake for 45-50 minutes, or until the top is golden brown and the moussaka is heated through. Let the moussaka cool for a few minutes before serving. Enjoy!",
	"photo": "MussakasMeMelitsanesKePatates01.jpg"
}